router:
  conf t
  int f0/0
  no shut
  ip add
  ip address ip mask
  router rip
  version 2
  network 10.1.1.0
  no auto-summary
  end
  pin
show ip int brief - mostra os ips
show ip route

#####Router1
** f0/0
R1#conf t
R1(config)#int f0/0
R1(config-if)#no shut
R1(config-if)#ip address 192.172.0.1 255.255.255.252
R1(config-if)#end

** s1/0
R1#conf t
R1(config)#int s1/0
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.1 255.255.255.252
R1(config-if)#end

** s1/1
R1#conf t
R1(config)#int s1/1
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.5 255.255.255.252
R1(config-if)#end

** router rip
R1#conf t
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#network 192.172.0.0
R1(config-router)#network 10.0.0.0
R1(config-router)#network 10.0.0.4


#####Router2
** s1/0
R1#conf t
R1(config)#int s1/0
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.6 255.255.255.252
R1(config-if)#end

** s1/1
R1#conf t
R1(config)#int s1/1
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.9 255.255.255.252
R1(config-if)#end

** s1/2
R1#conf t
R1(config)#int s1/2
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.13 255.255.255.252
R1(config-if)#end

** router rip
R1#conf t
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#network 10.0.0.4
R1(config-router)#network 10.0.0.8
R1(config-router)#network 10.0.0.12

#####Router3
** f0/0
R3#conf t
R3(config)#int f0/0
R3(config-if)#no shut
R3(config-if)#ip addres 192.172.1.1 255.255.255.252
R3(config-if)#end

** s1/0
R1#conf t
R1(config)#int s1/0
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.10 255.255.255.252
R1(config-if)#end

** s1/1
R1#conf t
R1(config)#int s1/1
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.17 255.255.255.252
R1(config-if)#end

** router rip
R1#conf t
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#network 10.0.0.8
R1(config-router)#network 10.0.0.16
R1(config-router)#network 192.172.1.0

#####Router5
** s1/0
R1#conf t
R1(config)#int s1/0
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.14 255.255.255.252
R1(config-if)#end

** s1/1
R1#conf t
R1(config)#int s1/0
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.18 255.255.255.252
R1(config-if)#end

** s1/2
R1#conf t
R1(config)#int s1/2
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.21 255.255.255.252
R1(config-if)#end

** router rip
R1#conf t
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#network 10.0.0.12
R1(config-router)#network 10.0.0.16
R1(config-router)#network 10.0.0.20

#####Router6
** s1/0
R1#conf t
R1(config)#int s1/0
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.2 255.255.255.252
R1(config-if)#end

** s1/1
R1#conf t
R1(config)#int s1/1
R1(config-if)#no shut
R1(config-if)#ip address 10.0.0.22 255.255.255.252
R1(config-if)#end

** router rip
R1#conf t
R1(config)#router rip
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#network 10.0.0.0
R1(config-router)#network 10.0.0.20







f0/0: 10.2.1.1 255.255.255.0
s1/0: 10.0.0.1 255.255.255.0
s1/1: 10.0.0.2 255.255.255.252

Router2
s1/0: 10.1.1.2 255.255.255.0
s1/1: 10.1.2.2 255.255.255.0
s1/2: 10.1.3.2 255.255.255.0

Router3
f0/0: 10.2.1.2 255.255.255.0
s1/0: 10.1.1.3 255.255.255.0
s1/1: 10.1.2.3 255.255.255.0

Router6
s1/0: 10.1.1.6 255.255.255.0
s1/1: 10.1.2.6 255.255.255.0

Router5
s1/0: 10.1.1.5 255.255.255.0
s1/1: 10.1.2.5 255.255.255.0
s1/2: 10.1.3.5 255.255.255.0